Revit 2027 API
DockableFrameVisibilityChangedEventArgs.PaneId Property
 The identifier for dockable pane.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneId PaneId { get; }
Public ReadOnly Property PaneId As DockablePaneId
	Get
public:
property DockablePaneId^ PaneId {
	DockablePaneId^ get ();
}
member PaneId : DockablePaneId with get
Property Value
DockablePaneId
See Also
Reference
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace